#+TITLE: Theano Model Graphs
#+AUTHOR: Brandon T. Willard
#+DATE: 2020-08-11
#+EMAIL: brandonwillard@gmail.com
#+FILETAGS: :draft:theano:pymc3:symbolic-pymc:

#+STARTUP: hideblocks indent hidestars
#+OPTIONS: author:t date:t ^:nil toc:t title:t tex:t d:(not "todo" "logbook" "note" "testing" "notes") html-preamble:t
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../extra/custom.css" />
#+STYLE: <link rel="stylesheet" type="text/css" href="../extra/custom.css" />

#+PROPERTY: header-args :eval never-export :exports both :results output drawer replace
#+PROPERTY: header-args+ :session theano-model-graphs :comments noweb
#+PROPERTY: header-args:python :noweb-sep "\n\n"
#+PROPERTY: header-args:latex :results html replace :exports results :eval yes

* Introduction

This document describes how Theano graphs can be used as a focal point
for Bayesian model specification, and how these graphs can be bridged with PyMC3
objects and--as a result--produce a dramatically more robust and simplified
foundation for PyMC3.

Yes, PyMC3 does use Theano--and, thus, Theano graphs--but it doesn't explicitly
build a graph for the relationships between random variables.  In the following,
we call such graphs [Theano] /sample-space graphs/ and we'll show how all the
forms of sampling performed by PyMC3 (i.e. prior and posterior predictive) can
be implemented using these graphs.  We'll also demonstrate how the
log-likelihood graphs currently used by PyMC3 can be constructed from such
graphs.

Before we go any further, let's look at a simple example of a sample-space graph.

:EXAMPLE:
Consider the model in Equation [[eqref:eq:simple-model]].
#+BEGIN_SRC latex
\begin{equation}
  \label{eq:simple-model}
  Y = a Z + b, \quad Z \sim \operatorname{N}\left( 0, \sigma^2 \right)
  \;,
\end{equation}
#+END_SRC

#+RESULTS:
#+begin_export html
\begin{equation}
  \label{eq:simple-model}
  Y = a Z + b, \quad Z \sim \operatorname{N}\left( 0, \sigma^2 \right)
  \;,
\end{equation}
#+end_export

Equation [[eqref:eq:simple-model]] can be represented by the Theano graph in Listing
[[simple-model-graph]].

#+NAME: simple-model-graph
#+BEGIN_SRC python :results silent
import theano
import theano.tensor as tt

from symbolic_pymc.theano.random_variables import NormalRV


a_tt = tt.vector('a')
b_tt = tt.vector('b')

sigma_tt = tt.scalar('sigma')

Z_rv = NormalRV(0, sigma_tt**2, name='Z')

Y_rv = a_tt * Z_rv + b_tt
#+END_SRC

When \(Y\) is an observed variable, the Theano graph represented by
src_python[:eval never]{Y_rv} is our sample-space graph of interest.
The graph for src_python[:eval never]{Z_rv} is also a sample-space graph,
and, in some cases, we'll refer to src_python[:eval never]{Y_rv} as
a /model graph/ due to its more direct correspondence to a model of interest
(e.g. Equation [[eqref:eq:simple-model]]).

Naturally, the Theano tensors objects src_python[:eval never]{Z_rv}
and src_python[:eval never]{Y_rv} are random variables, but--more
specifically--the former is a direct output of
a src_python[:eval never]{RandomVariable} operator, while the latter
is a function of the aforementioned src_python[:eval never]{RandomVariable}
output.  This distinction will be important in what follows, but it suffices to
say that both represent random draws from a distribution.

We can sample either of them--or both--by simply compiling the graphs into
functions and evaluating those functions.  This is demonstrated in Listing
[[sample-simple-model-graph]].

#+NAME: sample-simple-model-graph
#+BEGIN_SRC python :results value :wrap "SRC python :eval never"
import numpy as np


Y_sampler = theano.function([a_tt, b_tt, sigma_tt], [Z_rv, Y_rv])

Y_sampler(np.r_[0.0, 1.0], np.r_[0.1, 0.3], 0.9)
#+END_SRC

#+RESULTS: sample-simple-model-graph
#+begin_SRC python :eval never
[array(-1.60047139), array([ 0.1       , -1.30047139])]
#+end_SRC
:END:

Throughout this exposition we'll use a non-trivial hidden Markov model (HMM) as
our guiding example.  These sorts of time-series are difficult to implement in
PyMC3 due to their reliance on the challenging src_python[:eval never]{Scan}
function, symbolic shape issues in PyMC3, and the general complexity involved in
writing their log-likelihoods and sampling functions--especially when one needs
to iterate on hierarchical changes to such models.  As a result, anything that
can improve their ease of use within PyMC3 is a worthwhile consideration.

:REMARK:
For other types of time-series that are represented and computed as Theano model
graphs see [[citet:WillardDynamicLinearModels2020]].  In those examples, custom
samplers are constructed by hand in Theano; however, here we're interested in
using PyMC3 to generate posterior samples.
:END:

That said, we'll demonstrate how the sample-space graphs for HMMs can be
specified with relative ease, and we'll build up to the construction of a custom
PyMC3 src_python[:eval never]{Distribution} class based entirely on
transformations of the original sample-space graph.

Ultimately, the process of deriving this src_python[:eval never]{Distribution}
class demonstrates how all of the model information and objects required by
PyMC3 can be derived from a sample-space graph.  As a result, automation of this
process would provide a new foundation for PyMC; one that can leverage Theano to
perform all the complicated sampling and doesn't suffer from the same symbolic
shape limitations, and one for which it is much simpler to reason about a model
systematically.  This new PyMC would also set the stage for specialized
optimizations that could dramatically improve performance.

